In [238]:
import pandas as pd
import numpy as np

In [239]:
df = pd.read_csv('adult.data.csv',
                 delimiter=',',
                )

# Need to Finish, highest earning country, highest earning country percentage and fix percentage without higher education that earn >50K

#  How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

# Sort Race

In [240]:
df['race'].value_counts().sort_index()

Amer-Indian-Eskimo      311
Asian-Pac-Islander     1039
Black                  3124
Other                   271
White                 27816
Name: race, dtype: int64

# Sort Sexs

In [241]:
sorted_sexs = df['sex'].value_counts().sort_index() # sorts the sexs and counts them 
sorted_sexs

Female    10771
Male      21790
Name: sex, dtype: int64

# What is the average age of men?

In [242]:
round(df.groupby(['sex']).get_group('Male').mean()[0], 1)

C:\Users\Woodzi\AppData\Local\Temp\ipykernel_13616\716992192.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  round(df.groupby(['sex']).get_group('Male').mean()[0], 1)

39.4

# Number of People with Higher Ed and Make >50K

In [243]:
higher_ed_Over_50 = df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))]
higher_ed_Over_50

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
11,30,State-gov,141297,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K
19,43,Self-emp-not-inc,292175,Masters,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
20,40,Private,193524,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,60,United-States,>50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32533,54,Private,337992,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Asian-Pac-Islander,Male,0,0,50,Japan,>50K
32536,34,Private,160216,Bachelors,13,Never-married,Exec-managerial,Not-in-family,White,Female,0,0,55,United-States,>50K
32538,38,Private,139180,Bachelors,13,Divorced,Prof-specialty,Unmarried,Black,Female,15020,0,45,United-States,>50K
32539,71,?,287372,Doctorate,16,Married-civ-spouse,?,Husband,White,Male,0,0,10,United-States,>50K
32554,53,Private,321865,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K

In [244]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sum())

education
Bachelors       2221
HS-grad         1675
11th              60
Masters          959
9th               27
Some-college    1387
Assoc-acdm       265
Assoc-voc        361
7th-8th           40
Doctorate        306
Prof-school      423
5th-6th           16
10th              62
1st-4th            6
Preschool          0
12th              33
Name: salary, dtype: int64

In [245]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sum()) # .values.sum()

education
Bachelors       3134
HS-grad         8826
11th            1115
Masters          764
9th              487
Some-college    5904
Assoc-acdm       802
Assoc-voc       1021
7th-8th          606
Doctorate        107
Prof-school      153
5th-6th          317
10th             871
1st-4th          162
Preschool         51
12th             400
Name: salary, dtype: int64

In [246]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sum()).values.sum()

7841

In [247]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sum()).values.sum()

24720

In [248]:
# the 2 above lines do add up to 32,561
df.shape

(32561, 15)

In [249]:
df_groupby = df.groupby('education')
df_column = df_groupby[['salary']]
df_column.tail()

      salary
31798  <=50K
32008  <=50K
32035  <=50K
32044  <=50K
32153  <=50K
...      ...
32556  <=50K
32557   >50K
32558  <=50K
32559  <=50K
32560   >50K

[80 rows x 1 columns]

# What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [250]:
num_min_workers = df.loc[(df['hours-per-week'] < 40) & (df['salary'] == '>50K')]
num_min_workers = round(len(num_min_workers)/len(df)*100, 1)
num_min_workers
# .size() might be an issue, it counts NA/null values that could be throwing off my percentages

2.3

# What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [251]:
num_min_hours_over_50 = df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')] 
len(num_min_hours_over_50)

2

In [252]:
# Percentage of rich among those who work fewest hours

In [253]:
sum_work_1hr = len(df.loc[(df['hours-per-week'] == 1)])
len_num_min_hours_over_50 = len(df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')])
rich_percentage = round(len_num_min_hours_over_50/sum_work_1hr*100, 1)
rich_percentage

10.0

In [254]:
len_higher_ed_Over_50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))])
len_higher_ed_Over_50

3486

In [255]:
len_all_over_50 = len(df.loc[(df['salary'] == '>50K')])
len_all_over_50

7841

# What country has the highest percentage of people that earn >50K?

In [256]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [257]:
# How do I add all the countries?

In [258]:
over_50_con = df.groupby("native-country", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sort_index().sum()).nlargest()
# returns country with highest number of rich
over_50_con.head(10)

native-country
United-States    7171
?                 146
Philippines        61
Germany            44
India              40
Name: salary, dtype: int64

In [259]:
# df.groupby(['sex']).get_group('Male').mean()
# df.groupby(['native-country', 'salary'], sort=True).sum()
under_50_con = df.groupby("native-country", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sort_index().sum()).nlargest()
# ************************************************************************************************

In [260]:
under_50_con

native-country
United-States    21999
Mexico             610
?                  437
Philippines        137
Puerto-Rico        102
Name: salary, dtype: int64

In [261]:
  len_higher_ed_Over_50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))])
  len_higher_ed_un50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '<=50K')) | ((df['education'] == 'Masters') & (df['salary'] == '<=50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '<=50K'))])
  len_all_higher_ed = len_higher_ed_un50 + len_higher_ed_Over_50
  higher_education_rich = round(len_higher_ed_Over_50/len_all_higher_ed*100, 1)

In [262]:
len_higher_ed_Over_50

3486

In [263]:
  # What percentage of people without advanced education (Bachelors, Masters, or Doctorate) make more than 50K?
  # **************************************************************************************************

In [264]:
all_ed_over_50 = df.groupby('education')['salary'].apply(lambda x: x.str.contains('>50K').sort_index().sum())
all_ed_over_50

education
10th              62
11th              60
12th              33
1st-4th            6
5th-6th           16
7th-8th           40
9th               27
Assoc-acdm       265
Assoc-voc        361
Bachelors       2221
Doctorate        306
HS-grad         1675
Masters          959
Preschool          0
Prof-school      423
Some-college    1387
Name: salary, dtype: int64

In [265]:
mask_miss   = ~df.loc[:, 'education'].str.contains('Bachelors')
mask_mrs    = ~df.loc[:, 'education'].str.contains('Doctorate')
mask_master = ~df.loc[:, 'education'].str.contains('Masters')
fifty_K = ~df.loc[:, 'salary'].str.contains('<=50K')
len_df = len(df)
total_o_50_bad_ed = len(df.loc[mask_miss & mask_mrs & mask_master & fifty_K, ('education', 'salary')])
lower_education_rich = round(total_o_50_bad_ed/len_df*100, 1)
df.loc[mask_miss & mask_mrs & mask_master & fifty_K, ('education', 'salary')]

          education salary
7           HS-grad   >50K
10     Some-college   >50K
14        Assoc-voc   >50K
27     Some-college   >50K
38     Some-college   >50K
...             ...    ...
32518       HS-grad   >50K
32519  Some-college   >50K
32545    Assoc-acdm   >50K
32557       HS-grad   >50K
32560       HS-grad   >50K

[4355 rows x 2 columns]

In [266]:
education = df.loc[:, 'education']
salary = df.loc[:, 'salary'].str.contains('>50K')
both = df.loc[salary, ('education', 'salary')]
both

          education salary
7           HS-grad   >50K
8           Masters   >50K
9         Bachelors   >50K
10     Some-college   >50K
11        Bachelors   >50K
...             ...    ...
32539     Doctorate   >50K
32545    Assoc-acdm   >50K
32554       Masters   >50K
32557       HS-grad   >50K
32560       HS-grad   >50K

[7841 rows x 2 columns]

total_o_50_bad_ed

In [267]:
len_df

32561

In [268]:
over_50_total = df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sort_index().sum()).nlargest()
over_50_total.head(20)

education
Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Name: salary, dtype: int64

In [269]:
highest_earning_country = None
highest_earning_country_percentage = None

# Identify the most popular occupation for those who earn >50K in India.

In [270]:
finding_occupation_India = df[(df['native-country'] == 'India') & (df['salary'] == '>50K')]
finding_max_occ = df['occupation'].value_counts()
finding_max_occ.index[0]

'Prof-specialty'

# Setting the index to be education the salary

In [271]:
si = df.set_index(['education', 'salary'])
all_salary_over_50 = df.loc[lambda df: df['salary'] == '>50K']

# What country has the highest percentage of people that earn >50K?

In [272]:
# getting all salaries over 50
salaries_o50 = df[(df['salary'] == '>50K')]
# getting all salaries under 50
salaries_un50 = df[(df['salary'] == '<=50K')]

o50c = salaries_o50[['native-country', 'salary']]
un50c = salaries_un50[['native-country', 'salary']]
o50c

      native-country salary
7      United-States   >50K
8      United-States   >50K
9      United-States   >50K
10     United-States   >50K
11             India   >50K
...              ...    ...
32539  United-States   >50K
32545  United-States   >50K
32554  United-States   >50K
32557  United-States   >50K
32560  United-States   >50K

[7841 rows x 2 columns]

In [273]:
salary_countries_sorted = df[['native-country', 'salary']].value_counts().sort_index()
o=0
n=1
salary = df.groupby(['native-country', 'salary'])['salary'].count()
salary
for a in (salary.index):
    print(a)
# sorting and counting using groupbyfor a,b in zip(countries_o50.index, countries_un50.index):
# missing 
# ('Outlying-US(Guam-USVI-etc)', '<=50K')
# ('Holand-Netherlands', '<=50K')
type(salary)

('?', '<=50K')
('?', '>50K')
('Cambodia', '<=50K')
('Cambodia', '>50K')
('Canada', '<=50K')
('Canada', '>50K')
('China', '<=50K')
('China', '>50K')
('Columbia', '<=50K')
('Columbia', '>50K')
('Cuba', '<=50K')
('Cuba', '>50K')
('Dominican-Republic', '<=50K')
('Dominican-Republic', '>50K')
('Ecuador', '<=50K')
('Ecuador', '>50K')
('El-Salvador', '<=50K')
('El-Salvador', '>50K')
('England', '<=50K')
('England', '>50K')
('France', '<=50K')
('France', '>50K')
('Germany', '<=50K')
('Germany', '>50K')
('Greece', '<=50K')
('Greece', '>50K')
('Guatemala', '<=50K')
('Guatemala', '>50K')
('Haiti', '<=50K')
('Haiti', '>50K')
('Holand-Netherlands', '<=50K')
('Honduras', '<=50K')
('Honduras', '>50K')
('Hong', '<=50K')
('Hong', '>50K')
('Hungary', '<=50K')
('Hungary', '>50K')
('India', '<=50K')
('India', '>50K')
('Iran', '<=50K')
('Iran', '>50K')
('Ireland', '<=50K')
('Ireland', '>50K')
('Italy', '<=50K')
('Italy', '>50K')
('Jamaica', '<=50K')
('Jamaica', '>50K')
('Japan', '<=50K')
('Japan', '>50K')
('Laos', '<=50K')
('Laos', '>50K')
('Mexico', '<=50K')
('Mexico', '>50K')
('Nicaragua', '<=50K')
('Nicaragua', '>50K')
('Outlying-US(Guam-USVI-etc)', '<=50K')
('Peru', '<=50K')
('Peru', '>50K')
('Philippines', '<=50K')
('Philippines', '>50K')
('Poland', '<=50K')
('Poland', '>50K')
('Portugal', '<=50K')
('Portugal', '>50K')
('Puerto-Rico', '<=50K')
('Puerto-Rico', '>50K')
('Scotland', '<=50K')
('Scotland', '>50K')
('South', '<=50K')
('South', '>50K')
('Taiwan', '<=50K')
('Taiwan', '>50K')
('Thailand', '<=50K')
('Thailand', '>50K')
('Trinadad&Tobago', '<=50K')
('Trinadad&Tobago', '>50K')
('United-States', '<=50K')
('United-States', '>50K')
('Vietnam', '<=50K')
('Vietnam', '>50K')
('Yugoslavia', '<=50K')
('Yugoslavia', '>50K')

pandas.core.series.Series

# Finding Missing Data

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [300]:
# Will try .get_groups
salary_countries_sorted.sort_index(ascending=False)

native-country  salary
Yugoslavia      >50K         6
                <=50K       10
Vietnam         >50K         5
                <=50K       62
United-States   >50K      7171
                          ...
Canada          <=50K       82
Cambodia        >50K         7
                <=50K       12
?               >50K       146
                <=50K      437
Length: 82, dtype: int64

In [275]:
sal_un_50 = ~df.loc[:, 'salary'].str.contains('<=50K')
salun50countries = df.loc[sal_un_50, ('native-country')].value_counts(sort=False).sort_index(ascending=False)
sal_o_50 = ~df.loc[:, 'salary'].str.contains('>50K') 
salo50countries = df.loc[sal_o_50, ('native-country')].value_counts(sort=False).sort_index(ascending=False)
# salo50countries, salun50countries

In [276]:

# salo50countries, salun50countries
average_salary_country = {}
for iter in salo50countries.items():
    average_salary_country[iter[0]] = iter[1]
salun50countries.describe()
so50 = salo50countries.to_frame('>50K')
sun50 = salun50countries.to_frame('<=50K')

In [294]:
together = pd.concat([so50, sun50], axis=1)
together['<=50K'] = together['<=50K'].fillna(0)
#ogether['average'] = together[['>50K', '<=50K']].mean(axis=1)
average = []
for a,b in zip(together['>50K'], together['<=50K']):
    average.append(round(a/(a+b), 2))
together['average'] = average
together

                             >50K   <=50K  average
Yugoslavia                     10     6.0     0.62
Vietnam                        62     5.0     0.93
United-States               21999  7171.0     0.75
Trinadad&Tobago                17     2.0     0.89
Thailand                       15     3.0     0.83
Taiwan                         31    20.0     0.61
South                          64    16.0     0.80
Scotland                        9     3.0     0.75
Puerto-Rico                   102    12.0     0.89
Portugal                       33     4.0     0.89
Poland                         48    12.0     0.80
Philippines                   137    61.0     0.69
Peru                           29     2.0     0.94
Outlying-US(Guam-USVI-etc)     14     0.0     1.00
Nicaragua                      32     2.0     0.94
Mexico                        610    33.0     0.95
Laos                           16     2.0     0.89
Japan                          38    24.0     0.61
Jamaica                        71    10.0     0.88
Italy                          48    25.0     0.66
Ireland                        19     5.0     0.79
Iran                           25    18.0     0.58
India                          60    40.0     0.60
Hungary                        10     3.0     0.77
Hong                           14     6.0     0.70
Honduras                       12     1.0     0.92
Holand-Netherlands              1     0.0     1.00
Haiti                          40     4.0     0.91
Guatemala                      61     3.0     0.95
Greece                         21     8.0     0.72
Germany                        93    44.0     0.68
France                         17    12.0     0.59
England                        60    30.0     0.67
El-Salvador                    97     9.0     0.92
Ecuador                        24     4.0     0.86
Dominican-Republic             68     2.0     0.97
Cuba                           70    25.0     0.74
Columbia                       57     2.0     0.97
China                          55    20.0     0.73
Canada                         82    39.0     0.68
Cambodia                       12     7.0     0.63
?                             437   146.0     0.75

# Counting number of times you have a Masters and make over >50K

select "native-country", education, salary 
	from adult_data
	where education = (select education from adult_data where education = "Masters");
this is same as below code in SQL

In [40]:
masters_ed_over50 = df.loc[df['education'] ==  'Masters', ['salary']] == '>50k'
masters_ed_over50.salary.value_counts()
masters_ed_over50.value_counts()

salary
False     1723
dtype: int64

In [41]:
  # df.loc[lambda df: df['education'] == 'Bachelors']

In [42]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [ ]:
# ('Outlying-US(Guam-USVI-etc)', '<=50K') ('Holand-Netherlands', '<=50K')

In [59]:
ed_country_salary = df.drop(columns=['age', 'workclass', 'fnlwgt', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'education'])
grouped = ed_country_salary.groupby(["native-country"]).value_counts().sort_index()

country_salary_count = dict()
for b in grouped.index:
    if b[0] in country_salary_count:
        country_salary_count[b[0]] += 1
    else:
        country_salary_count[b[0]] = 1
grouped

native-country  salary
?               <=50K      437
                >50K       146
Cambodia        <=50K       12
                >50K         7
Canada          <=50K       82
                          ...
United-States   >50K      7171
Vietnam         <=50K       62
                >50K         5
Yugoslavia      <=50K       10
                >50K         6
Length: 82, dtype: int64